//----------------------------------------------------
行列の足し算
問題説明
行列の足し算は行と列の大きさが同じ二つの行列の同じ行、同じ列の値を足した結果になります。
 2つの行列arr1とarr2を入力してもらい、行列加算の結果を返す関数、solutionを完成してください。
    
    制限条件
    行列arr1、arr2の行と列の長さは500を超えません。
    入出力例
    arr1             arr2                return
    [[1,2],[2,3]]   [[3,4],[5,6]]       [[4,6],[7,9]]
    [[1],[2]]       [[3],[4]]           [[4],[6]]
//---------------------------------------------------------------
    
class MatrixSum {
    public int[][] main(int[][] arr1, int[][] arr2) {
        int[][] answer = new int[arr1.length][arr1[0].length];
        
        for (int i = 0; i < arr1.length; i++ ){
            for (int j = 0; j < arr1[0].length; j++){
                answer[i][j] = arr1[i][j] + arr2[i][j];
            }
            
        }
         return answer;
    }
}
